{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v2.0.1.post1", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "retinanet", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "padding_conv1", "class_name": "ZeroPadding2D", "config": {"name": "padding_conv1", "trainable": true, "dtype": "float32", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [7, 7], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding_conv1", 0, 0, {}]]]}, {"name": "bn_conv1", "class_name": "BatchNormalization", "config": {"name": "bn_conv1", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv1_relu", "class_name": "Activation", "config": {"name": "conv1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn_conv1", 0, 0, {}]]]}, {"name": "pool1", "class_name": "MaxPooling2D", "config": {"name": "pool1", "trainable": true, "dtype": "float32", "pool_size": [3, 3], "padding": "same", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv1_relu", 0, 0, {}]]]}, {"name": "padding2a_branch2a", "class_name": "ZeroPadding2D", "config": {"name": "padding2a_branch2a", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "res2a_branch2a", "class_name": "Conv2D", "config": {"name": "res2a_branch2a", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding2a_branch2a", 0, 0, {}]]]}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2a", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]]}, {"name": "res2a_branch2a_relu", "class_name": "Activation", "config": {"name": "res2a_branch2a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]]}, {"name": "padding2a_branch2b", "class_name": "ZeroPadding2D", "config": {"name": "padding2a_branch2b", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res2a_branch2a_relu", 0, 0, {}]]]}, {"name": "res2a_branch2b", "class_name": "Conv2D", "config": {"name": "res2a_branch2b", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding2a_branch2b", 0, 0, {}]]]}, {"name": "res2a_branch1", "class_name": "Conv2D", "config": {"name": "res2a_branch1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "bn2a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch2b", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]]}, {"name": "bn2a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn2a_branch1", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]]}, {"name": "res2a", "class_name": "Add", "config": {"name": "res2a", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]]}, {"name": "res2a_relu", "class_name": "Activation", "config": {"name": "res2a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["res2a", 0, 0, {}]]]}, {"name": "padding2b1_branch2a", "class_name": "ZeroPadding2D", "config": {"name": "padding2b1_branch2a", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res2a_relu", 0, 0, {}]]]}, {"name": "res2b1_branch2a", "class_name": "Conv2D", "config": {"name": "res2b1_branch2a", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding2b1_branch2a", 0, 0, {}]]]}, {"name": "bn2b1_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn2b1_branch2a", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res2b1_branch2a", 0, 0, {}]]]}, {"name": "res2b1_branch2a_relu", "class_name": "Activation", "config": {"name": "res2b1_branch2a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn2b1_branch2a", 0, 0, {}]]]}, {"name": "padding2b1_branch2b", "class_name": "ZeroPadding2D", "config": {"name": "padding2b1_branch2b", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res2b1_branch2a_relu", 0, 0, {}]]]}, {"name": "res2b1_branch2b", "class_name": "Conv2D", "config": {"name": "res2b1_branch2b", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding2b1_branch2b", 0, 0, {}]]]}, {"name": "bn2b1_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn2b1_branch2b", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res2b1_branch2b", 0, 0, {}]]]}, {"name": "res2b1", "class_name": "Add", "config": {"name": "res2b1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn2b1_branch2b", 0, 0, {}], ["res2a_relu", 0, 0, {}]]]}, {"name": "res2b1_relu", "class_name": "Activation", "config": {"name": "res2b1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["res2b1", 0, 0, {}]]]}, {"name": "padding3a_branch2a", "class_name": "ZeroPadding2D", "config": {"name": "padding3a_branch2a", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res2b1_relu", 0, 0, {}]]]}, {"name": "res3a_branch2a", "class_name": "Conv2D", "config": {"name": "res3a_branch2a", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding3a_branch2a", 0, 0, {}]]]}, {"name": "bn3a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2a", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]]}, {"name": "res3a_branch2a_relu", "class_name": "Activation", "config": {"name": "res3a_branch2a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]]}, {"name": "padding3a_branch2b", "class_name": "ZeroPadding2D", "config": {"name": "padding3a_branch2b", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res3a_branch2a_relu", 0, 0, {}]]]}, {"name": "res3a_branch2b", "class_name": "Conv2D", "config": {"name": "res3a_branch2b", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding3a_branch2b", 0, 0, {}]]]}, {"name": "res3a_branch1", "class_name": "Conv2D", "config": {"name": "res3a_branch1", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res2b1_relu", 0, 0, {}]]]}, {"name": "bn3a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch2b", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]]}, {"name": "bn3a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn3a_branch1", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]]}, {"name": "res3a", "class_name": "Add", "config": {"name": "res3a", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]]}, {"name": "res3a_relu", "class_name": "Activation", "config": {"name": "res3a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["res3a", 0, 0, {}]]]}, {"name": "padding3b1_branch2a", "class_name": "ZeroPadding2D", "config": {"name": "padding3b1_branch2a", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res3a_relu", 0, 0, {}]]]}, {"name": "res3b1_branch2a", "class_name": "Conv2D", "config": {"name": "res3b1_branch2a", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding3b1_branch2a", 0, 0, {}]]]}, {"name": "bn3b1_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn3b1_branch2a", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res3b1_branch2a", 0, 0, {}]]]}, {"name": "res3b1_branch2a_relu", "class_name": "Activation", "config": {"name": "res3b1_branch2a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn3b1_branch2a", 0, 0, {}]]]}, {"name": "padding3b1_branch2b", "class_name": "ZeroPadding2D", "config": {"name": "padding3b1_branch2b", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res3b1_branch2a_relu", 0, 0, {}]]]}, {"name": "res3b1_branch2b", "class_name": "Conv2D", "config": {"name": "res3b1_branch2b", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding3b1_branch2b", 0, 0, {}]]]}, {"name": "bn3b1_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn3b1_branch2b", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res3b1_branch2b", 0, 0, {}]]]}, {"name": "res3b1", "class_name": "Add", "config": {"name": "res3b1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn3b1_branch2b", 0, 0, {}], ["res3a_relu", 0, 0, {}]]]}, {"name": "res3b1_relu", "class_name": "Activation", "config": {"name": "res3b1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["res3b1", 0, 0, {}]]]}, {"name": "padding4a_branch2a", "class_name": "ZeroPadding2D", "config": {"name": "padding4a_branch2a", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res3b1_relu", 0, 0, {}]]]}, {"name": "res4a_branch2a", "class_name": "Conv2D", "config": {"name": "res4a_branch2a", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding4a_branch2a", 0, 0, {}]]]}, {"name": "bn4a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2a", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]]}, {"name": "res4a_branch2a_relu", "class_name": "Activation", "config": {"name": "res4a_branch2a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]]}, {"name": "padding4a_branch2b", "class_name": "ZeroPadding2D", "config": {"name": "padding4a_branch2b", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res4a_branch2a_relu", 0, 0, {}]]]}, {"name": "res4a_branch2b", "class_name": "Conv2D", "config": {"name": "res4a_branch2b", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding4a_branch2b", 0, 0, {}]]]}, {"name": "res4a_branch1", "class_name": "Conv2D", "config": {"name": "res4a_branch1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res3b1_relu", 0, 0, {}]]]}, {"name": "bn4a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch2b", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]]}, {"name": "bn4a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn4a_branch1", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]]}, {"name": "res4a", "class_name": "Add", "config": {"name": "res4a", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]]}, {"name": "res4a_relu", "class_name": "Activation", "config": {"name": "res4a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["res4a", 0, 0, {}]]]}, {"name": "padding4b1_branch2a", "class_name": "ZeroPadding2D", "config": {"name": "padding4b1_branch2a", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res4a_relu", 0, 0, {}]]]}, {"name": "res4b1_branch2a", "class_name": "Conv2D", "config": {"name": "res4b1_branch2a", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding4b1_branch2a", 0, 0, {}]]]}, {"name": "bn4b1_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn4b1_branch2a", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res4b1_branch2a", 0, 0, {}]]]}, {"name": "res4b1_branch2a_relu", "class_name": "Activation", "config": {"name": "res4b1_branch2a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn4b1_branch2a", 0, 0, {}]]]}, {"name": "padding4b1_branch2b", "class_name": "ZeroPadding2D", "config": {"name": "padding4b1_branch2b", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res4b1_branch2a_relu", 0, 0, {}]]]}, {"name": "res4b1_branch2b", "class_name": "Conv2D", "config": {"name": "res4b1_branch2b", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding4b1_branch2b", 0, 0, {}]]]}, {"name": "bn4b1_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn4b1_branch2b", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res4b1_branch2b", 0, 0, {}]]]}, {"name": "res4b1", "class_name": "Add", "config": {"name": "res4b1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn4b1_branch2b", 0, 0, {}], ["res4a_relu", 0, 0, {}]]]}, {"name": "res4b1_relu", "class_name": "Activation", "config": {"name": "res4b1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["res4b1", 0, 0, {}]]]}, {"name": "padding5a_branch2a", "class_name": "ZeroPadding2D", "config": {"name": "padding5a_branch2a", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res4b1_relu", 0, 0, {}]]]}, {"name": "res5a_branch2a", "class_name": "Conv2D", "config": {"name": "res5a_branch2a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding5a_branch2a", 0, 0, {}]]]}, {"name": "bn5a_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn5a_branch2a", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res5a_branch2a", 0, 0, {}]]]}, {"name": "res5a_branch2a_relu", "class_name": "Activation", "config": {"name": "res5a_branch2a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn5a_branch2a", 0, 0, {}]]]}, {"name": "padding5a_branch2b", "class_name": "ZeroPadding2D", "config": {"name": "padding5a_branch2b", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res5a_branch2a_relu", 0, 0, {}]]]}, {"name": "res5a_branch2b", "class_name": "Conv2D", "config": {"name": "res5a_branch2b", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding5a_branch2b", 0, 0, {}]]]}, {"name": "res5a_branch1", "class_name": "Conv2D", "config": {"name": "res5a_branch1", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res4b1_relu", 0, 0, {}]]]}, {"name": "bn5a_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn5a_branch2b", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res5a_branch2b", 0, 0, {}]]]}, {"name": "bn5a_branch1", "class_name": "BatchNormalization", "config": {"name": "bn5a_branch1", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res5a_branch1", 0, 0, {}]]]}, {"name": "res5a", "class_name": "Add", "config": {"name": "res5a", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn5a_branch2b", 0, 0, {}], ["bn5a_branch1", 0, 0, {}]]]}, {"name": "res5a_relu", "class_name": "Activation", "config": {"name": "res5a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["res5a", 0, 0, {}]]]}, {"name": "padding5b1_branch2a", "class_name": "ZeroPadding2D", "config": {"name": "padding5b1_branch2a", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res5a_relu", 0, 0, {}]]]}, {"name": "res5b1_branch2a", "class_name": "Conv2D", "config": {"name": "res5b1_branch2a", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding5b1_branch2a", 0, 0, {}]]]}, {"name": "bn5b1_branch2a", "class_name": "BatchNormalization", "config": {"name": "bn5b1_branch2a", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res5b1_branch2a", 0, 0, {}]]]}, {"name": "res5b1_branch2a_relu", "class_name": "Activation", "config": {"name": "res5b1_branch2a_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn5b1_branch2a", 0, 0, {}]]]}, {"name": "padding5b1_branch2b", "class_name": "ZeroPadding2D", "config": {"name": "padding5b1_branch2b", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["res5b1_branch2a_relu", 0, 0, {}]]]}, {"name": "res5b1_branch2b", "class_name": "Conv2D", "config": {"name": "res5b1_branch2b", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["padding5b1_branch2b", 0, 0, {}]]]}, {"name": "bn5b1_branch2b", "class_name": "BatchNormalization", "config": {"name": "bn5b1_branch2b", "trainable": true, "dtype": "float32", "axis": 3, "momentum": 0.99, "epsilon": 1e-05, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "freeze": false}, "inbound_nodes": [[["res5b1_branch2b", 0, 0, {}]]]}, {"name": "res5b1", "class_name": "Add", "config": {"name": "res5b1", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["bn5b1_branch2b", 0, 0, {}], ["res5a_relu", 0, 0, {}]]]}, {"name": "res5b1_relu", "class_name": "Activation", "config": {"name": "res5b1_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["res5b1", 0, 0, {}]]]}, {"name": "C5_reduced", "class_name": "Conv2D", "config": {"name": "C5_reduced", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res5b1_relu", 0, 0, {}]]]}, {"name": "P5_upsampled", "class_name": "UpsampleLike", "config": {"name": "P5_upsampled", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["C5_reduced", 0, 0, {}], ["res4b1_relu", 0, 0, {}]]]}, {"name": "C4_reduced", "class_name": "Conv2D", "config": {"name": "C4_reduced", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res4b1_relu", 0, 0, {}]]]}, {"name": "P4_merged", "class_name": "Add", "config": {"name": "P4_merged", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["P5_upsampled", 0, 0, {}], ["C4_reduced", 0, 0, {}]]]}, {"name": "P4_upsampled", "class_name": "UpsampleLike", "config": {"name": "P4_upsampled", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["P4_merged", 0, 0, {}], ["res3b1_relu", 0, 0, {}]]]}, {"name": "C3_reduced", "class_name": "Conv2D", "config": {"name": "C3_reduced", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res3b1_relu", 0, 0, {}]]]}, {"name": "P6", "class_name": "Conv2D", "config": {"name": "P6", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["res5b1_relu", 0, 0, {}]]]}, {"name": "P3_merged", "class_name": "Add", "config": {"name": "P3_merged", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["P4_upsampled", 0, 0, {}], ["C3_reduced", 0, 0, {}]]]}, {"name": "C6_relu", "class_name": "Activation", "config": {"name": "C6_relu", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["P6", 0, 0, {}]]]}, {"name": "P3", "class_name": "Conv2D", "config": {"name": "P3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["P3_merged", 0, 0, {}]]]}, {"name": "P4", "class_name": "Conv2D", "config": {"name": "P4", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["P4_merged", 0, 0, {}]]]}, {"name": "P5", "class_name": "Conv2D", "config": {"name": "P5", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["C5_reduced", 0, 0, {}]]]}, {"name": "P7", "class_name": "Conv2D", "config": {"name": "P7", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["C6_relu", 0, 0, {}]]]}, {"name": "regression_submodel", "class_name": "Model", "config": {"name": "regression_submodel", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 256], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "pyramid_regression_0", "class_name": "Conv2D", "config": {"name": "pyramid_regression_0", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "pyramid_regression_1", "class_name": "Conv2D", "config": {"name": "pyramid_regression_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pyramid_regression_0", 0, 0, {}]]]}, {"name": "pyramid_regression_2", "class_name": "Conv2D", "config": {"name": "pyramid_regression_2", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pyramid_regression_1", 0, 0, {}]]]}, {"name": "pyramid_regression_3", "class_name": "Conv2D", "config": {"name": "pyramid_regression_3", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pyramid_regression_2", 0, 0, {}]]]}, {"name": "pyramid_regression", "class_name": "Conv2D", "config": {"name": "pyramid_regression", "trainable": true, "dtype": "float32", "filters": 36, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["pyramid_regression_3", 0, 0, {}]]]}, {"name": "pyramid_regression_reshape", "class_name": "Reshape", "config": {"name": "pyramid_regression_reshape", "trainable": true, "dtype": "float32", "target_shape": [-1, 4]}, "inbound_nodes": [[["pyramid_regression", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["pyramid_regression_reshape", 0, 0]]}, "inbound_nodes": [[["P3", 0, 0, {}]], [["P4", 0, 0, {}]], [["P5", 0, 0, {}]], [["P6", 0, 0, {}]], [["P7", 0, 0, {}]]]}, {"name": "classification_submodel", "class_name": "Model", "config": {"name": "classification_submodel", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 256], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "pyramid_classification_0", "class_name": "Conv2D", "config": {"name": "pyramid_classification_0", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "pyramid_classification_1", "class_name": "Conv2D", "config": {"name": "pyramid_classification_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.01, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}},